{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# References:\n",
    "-"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Import libraries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\u001b[33mWARNING: Ignoring invalid distribution -eras-preprocessing (/opt/anaconda3/lib/python3.8/site-packages)\u001b[0m\n",
      "\u001b[33mWARNING: Ignoring invalid distribution -atplotlib (/opt/anaconda3/lib/python3.8/site-packages)\u001b[0m\n",
      "\u001b[33mWARNING: Ignoring invalid distribution -eras-preprocessing (/opt/anaconda3/lib/python3.8/site-packages)\u001b[0m\n",
      "\u001b[33mWARNING: Ignoring invalid distribution -atplotlib (/opt/anaconda3/lib/python3.8/site-packages)\u001b[0m\n",
      "Requirement already satisfied: py2neo in /opt/anaconda3/lib/python3.8/site-packages (2021.2.3)\n",
      "Requirement already satisfied: pansi>=2020.7.3 in /opt/anaconda3/lib/python3.8/site-packages (from py2neo) (2020.7.3)\n",
      "Requirement already satisfied: interchange~=2021.0.4 in /opt/anaconda3/lib/python3.8/site-packages (from py2neo) (2021.0.4)\n",
      "Requirement already satisfied: monotonic in /opt/anaconda3/lib/python3.8/site-packages (from py2neo) (1.6)\n",
      "Requirement already satisfied: pygments>=2.0.0 in /opt/anaconda3/lib/python3.8/site-packages (from py2neo) (2.8.1)\n",
      "Requirement already satisfied: certifi in /opt/anaconda3/lib/python3.8/site-packages (from py2neo) (2020.12.5)\n",
      "Requirement already satisfied: six>=1.15.0 in /opt/anaconda3/lib/python3.8/site-packages (from py2neo) (1.15.0)\n",
      "Requirement already satisfied: packaging in /opt/anaconda3/lib/python3.8/site-packages (from py2neo) (20.9)\n",
      "Requirement already satisfied: urllib3 in /opt/anaconda3/lib/python3.8/site-packages (from py2neo) (1.26.5)\n",
      "Requirement already satisfied: pytz in /opt/anaconda3/lib/python3.8/site-packages (from interchange~=2021.0.4->py2neo) (2020.5)\n",
      "Requirement already satisfied: pyparsing>=2.0.2 in /opt/anaconda3/lib/python3.8/site-packages (from packaging->py2neo) (2.4.7)\n",
      "\u001b[33mWARNING: Ignoring invalid distribution -eras-preprocessing (/opt/anaconda3/lib/python3.8/site-packages)\u001b[0m\n",
      "\u001b[33mWARNING: Ignoring invalid distribution -atplotlib (/opt/anaconda3/lib/python3.8/site-packages)\u001b[0m\n",
      "\u001b[33mWARNING: Ignoring invalid distribution -eras-preprocessing (/opt/anaconda3/lib/python3.8/site-packages)\u001b[0m\n",
      "\u001b[33mWARNING: Ignoring invalid distribution -atplotlib (/opt/anaconda3/lib/python3.8/site-packages)\u001b[0m\n",
      "\u001b[33mWARNING: Ignoring invalid distribution -eras-preprocessing (/opt/anaconda3/lib/python3.8/site-packages)\u001b[0m\n",
      "\u001b[33mWARNING: Ignoring invalid distribution -atplotlib (/opt/anaconda3/lib/python3.8/site-packages)\u001b[0m\n"
     ]
    }
   ],
   "source": [
    "!pip3 install py2neo"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pprint import pprint\n",
    "from py2neo import Graph\n",
    "g = Graph(\"bolt://localhost:7687/neo4j\", password = \"test\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Refrigerator</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Paid parking off premises</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Long term stays allowed</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      a.name\n",
       "0               Refrigerator\n",
       "1  Paid parking off premises\n",
       "2    Long term stays allowed"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH (a:Amenity) RETURN a.name LIMIT 3\n",
    "\"\"\"\n",
    "g.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>a.name</th>\n",
       "      <th>a.price</th>\n",
       "      <th>a.url</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>571029</td>\n",
       "      <td>$150.00</td>\n",
       "      <td>https://www.airbnb.com/rooms/571029</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>729260</td>\n",
       "      <td>$150.00</td>\n",
       "      <td>https://www.airbnb.com/rooms/729260</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>733654</td>\n",
       "      <td>$150.00</td>\n",
       "      <td>https://www.airbnb.com/rooms/733654</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   a.name  a.price                                a.url\n",
       "0  571029  $150.00  https://www.airbnb.com/rooms/571029\n",
       "1  729260  $150.00  https://www.airbnb.com/rooms/729260\n",
       "2  733654  $150.00  https://www.airbnb.com/rooms/733654"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"\"\"\n",
    "MATCH (a:Listing) WHERE a.price='$150.00' RETURN a.name,a.price,a.url LIMIT 3\n",
    "\"\"\"\n",
    "g.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Content-based filtering"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>UserListing</th>\n",
       "      <th>Recommendate</th>\n",
       "      <th>UserListingAmenities</th>\n",
       "      <th>RecommendateListingAmenities</th>\n",
       "      <th>jaccard</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2818</td>\n",
       "      <td>17968731</td>\n",
       "      <td>[Ethernet connection, Dedicated workspace: tab...</td>\n",
       "      <td>[Ethernet connection, Hot water kettle, Essent...</td>\n",
       "      <td>0.600000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2818</td>\n",
       "      <td>2211896</td>\n",
       "      <td>[Ethernet connection, Dedicated workspace: tab...</td>\n",
       "      <td>[Babysitter recommendations, Dedicated workspa...</td>\n",
       "      <td>0.547170</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2818</td>\n",
       "      <td>9104541</td>\n",
       "      <td>[Ethernet connection, Dedicated workspace: tab...</td>\n",
       "      <td>[Ethernet connection, Essentials, Private entr...</td>\n",
       "      <td>0.540000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2818</td>\n",
       "      <td>43978539</td>\n",
       "      <td>[Ethernet connection, Dedicated workspace: tab...</td>\n",
       "      <td>[Pour-over coffee, Hot water kettle, Essential...</td>\n",
       "      <td>0.530612</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2818</td>\n",
       "      <td>17968930</td>\n",
       "      <td>[Ethernet connection, Dedicated workspace: tab...</td>\n",
       "      <td>[Ethernet connection, Hot water kettle, Essent...</td>\n",
       "      <td>0.520833</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5390</th>\n",
       "      <td>2818</td>\n",
       "      <td>50916897</td>\n",
       "      <td>[Ethernet connection, Dedicated workspace: tab...</td>\n",
       "      <td>[TV, Kitchen, Paid parking on premises, Washer...</td>\n",
       "      <td>0.022222</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5391</th>\n",
       "      <td>2818</td>\n",
       "      <td>778820</td>\n",
       "      <td>[Ethernet connection, Dedicated workspace: tab...</td>\n",
       "      <td>[Cable TV, TV with standard cable, Kitchen, He...</td>\n",
       "      <td>0.021739</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5392</th>\n",
       "      <td>2818</td>\n",
       "      <td>51779734</td>\n",
       "      <td>[Ethernet connection, Dedicated workspace: tab...</td>\n",
       "      <td>[TV, Dedicated workspace, Kitchen, Long term s...</td>\n",
       "      <td>0.021739</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5393</th>\n",
       "      <td>2818</td>\n",
       "      <td>53043715</td>\n",
       "      <td>[Ethernet connection, Dedicated workspace: tab...</td>\n",
       "      <td>[Free parking on premises, TV, Kitchen, Long t...</td>\n",
       "      <td>0.021277</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5394</th>\n",
       "      <td>2818</td>\n",
       "      <td>307621</td>\n",
       "      <td>[Ethernet connection, Dedicated workspace: tab...</td>\n",
       "      <td>[Cable TV, TV with standard cable, Kitchen, He...</td>\n",
       "      <td>0.020833</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5395 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     UserListing Recommendate  \\\n",
       "0           2818     17968731   \n",
       "1           2818      2211896   \n",
       "2           2818      9104541   \n",
       "3           2818     43978539   \n",
       "4           2818     17968930   \n",
       "...          ...          ...   \n",
       "5390        2818     50916897   \n",
       "5391        2818       778820   \n",
       "5392        2818     51779734   \n",
       "5393        2818     53043715   \n",
       "5394        2818       307621   \n",
       "\n",
       "                                   UserListingAmenities  \\\n",
       "0     [Ethernet connection, Dedicated workspace: tab...   \n",
       "1     [Ethernet connection, Dedicated workspace: tab...   \n",
       "2     [Ethernet connection, Dedicated workspace: tab...   \n",
       "3     [Ethernet connection, Dedicated workspace: tab...   \n",
       "4     [Ethernet connection, Dedicated workspace: tab...   \n",
       "...                                                 ...   \n",
       "5390  [Ethernet connection, Dedicated workspace: tab...   \n",
       "5391  [Ethernet connection, Dedicated workspace: tab...   \n",
       "5392  [Ethernet connection, Dedicated workspace: tab...   \n",
       "5393  [Ethernet connection, Dedicated workspace: tab...   \n",
       "5394  [Ethernet connection, Dedicated workspace: tab...   \n",
       "\n",
       "                           RecommendateListingAmenities   jaccard  \n",
       "0     [Ethernet connection, Hot water kettle, Essent...  0.600000  \n",
       "1     [Babysitter recommendations, Dedicated workspa...  0.547170  \n",
       "2     [Ethernet connection, Essentials, Private entr...  0.540000  \n",
       "3     [Pour-over coffee, Hot water kettle, Essential...  0.530612  \n",
       "4     [Ethernet connection, Hot water kettle, Essent...  0.520833  \n",
       "...                                                 ...       ...  \n",
       "5390  [TV, Kitchen, Paid parking on premises, Washer...  0.022222  \n",
       "5391  [Cable TV, TV with standard cable, Kitchen, He...  0.021739  \n",
       "5392  [TV, Dedicated workspace, Kitchen, Long term s...  0.021739  \n",
       "5393  [Free parking on premises, TV, Kitchen, Long t...  0.021277  \n",
       "5394  [Cable TV, TV with standard cable, Kitchen, He...  0.020833  \n",
       "\n",
       "[5395 rows x 5 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "query = \"\"\"\n",
    "MATCH(u:User{name:'10952'})-[:RATED]->(s:Listing)-[:HAS_AMENITY]->(c:Amenity)<-[:HAS_AMENITY]-(z:Listing)\n",
    "WHERE NOT EXISTS ((u)-[:RATED]->(z))\n",
    "WITH s, z, COUNT(c) AS intersection\n",
    "MATCH (s)-[:HAS_AMENITY]->(sc:Amenity)\n",
    "WITH s, z, intersection, COLLECT(sc.name) AS s1\n",
    "MATCH (z)-[:HAS_AMENITY]->(zc:Amenity)\n",
    "WITH s, z, s1, intersection, COLLECT(zc.name) AS s2\n",
    "WITH s, z, intersection, s1+[x IN s2 WHERE NOT x IN s1] AS union, s1, s2\n",
    "RETURN s.name as UserListing, z.name as Recommendate, s1 as UserListingAmenities, s2 as RecommendateListingAmenities, ((1.0*intersection)/SIZE(union)) AS jaccard ORDER BY jaccard DESC;\n",
    "\"\"\"\n",
    "g.run(query).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'SelectedUser': '8726758', 'SimilarUser': '303616415'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '409078673'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '56663354'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '330320508'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '47472820'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '15428796'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '303383524'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '156086800'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '61906534'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '271440120'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '245214095'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '95511875'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '275958549'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '62950521'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '157035237'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '262880880'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '220128053'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '250234578'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '16155483'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '8923210'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '199609327'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '82064994'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '98166018'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '178420718'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '43440293'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '130070151'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '128648334'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '24675898'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '223353351'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '94583077'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '241296487'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '160791963'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '535440'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '216099941'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '224678257'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '138914196'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '7880798'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '115002275'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '85503590'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '28820705'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '151221256'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '72722202'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '27415312'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '207303078'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '33989203'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '38247916'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '189402300'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '191740514'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '15387714'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '182747240'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '54346074'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '24554860'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '181644093'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '169551113'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '106101577'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '159519256'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '65825127'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '106747691'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '156777916'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '173501638'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '21979733'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '135844724'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '998391'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '33086171'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '170840'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '16352805'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '48294868'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '144767078'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '45406846'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '31861525'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '8726758'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '83310112'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '32092080'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '1424777'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '138208744'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '36507467'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '95737694'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '20308278'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '127316896'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '26702728'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '64367573'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '110240282'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '18973112'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '659272'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '105141578'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '25064576'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '82054823'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '32648031'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '68398465'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '42356044'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '3573745'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '110434784'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '74924579'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '13200559'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '7332531'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '35993834'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '57460462'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '99107178'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '1425576'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '82401443'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '50454874'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '51103011'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '68880561'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '86982412'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '7296254'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '91002807'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '49335486'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '73407547'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '63636738'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '82680418'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '79524064'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '72231523'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '35763330'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '13275394'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '69264437'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '60449351'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '28842205'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '69873720'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '3128082'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '65081042'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '3737004'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '37801685'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '39647118'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '58962573'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '5580754'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '61554932'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '54059610'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '9256834'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '35683115'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '59952114'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '46365802'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '50890706'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '13310386'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '27998106'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '46397401'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '46575287'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '31905488'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '35787213'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '44594267'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '32431176'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '25665174'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '2537590'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '6399770'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '32694943'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '33350700'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '17293453'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '11275359'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '32161750'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '33997818'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '30289149'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '28738000'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '30524482'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '10515603'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '19020174'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '31949785'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '27077782'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '28987927'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '19089720'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '30960842'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '28665630'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '27906188'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '27822904'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '25907928'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '28712303'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '17837628'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '3321930'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '25733503'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '3630328'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '25399998'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '24755577'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '7992090'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '13546702'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '4592146'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '21388205'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '13195901'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '6488881'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '20989264'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '12213592'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '20565927'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '19381082'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '10676984'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '16393098'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '11877341'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '17449732'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '15927333'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '15548753'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '17103969'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '13154289'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '14891811'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '14368839'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '4629258'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '10641872'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '6029464'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '6790170'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '758617'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '6167602'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '5787671'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '5640272'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '5253122'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '193685'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '3018525'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '2481566'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '2059915'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '1899497'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '2133939'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '1315953'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '1475799'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '62868'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '1119102'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '400176'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '711463'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '668411'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '636413'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '229991'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '485490'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '442422'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '422476'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '374779'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '329040'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '54482'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '241053'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '216750'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '224147'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '227259'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '217961'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '211004'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '202035'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '105289'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '175043'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '171625'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '164729'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '15745'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '147769'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '97097'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '131821'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '99878'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '79479'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '112391'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '103149'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '97200'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '82918'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '33284'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '55661'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '48138'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '20192'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '17977'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '14064'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '11869'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '12798'}\n",
      "{'SelectedUser': '8726758', 'SimilarUser': '10952'}\n"
     ]
    }
   ],
   "source": [
    "cid = \"8726758\"\n",
    "query = \"\"\"\n",
    "        MATCH (p1:User {name:'8726758'})-[x:RATED]->(m:Listing)<-[y:RATED]-(p2:User) WITH COUNT(m) AS numbershows, SUM(x.rating * y.rating) AS xyDotProduct,SQRT(REDUCE(xDot = 0.0, a IN COLLECT(x.rating) | xDot + a^2)) AS xLength,SQRT(REDUCE(yDot = 0.0, b IN COLLECT(y.rating) | yDot + b^2)) AS yLength,p1, p2 RETURN p1.name as SelectedUser, p2.name as SimilarUser;\n",
    "        \"\"\"\n",
    "\n",
    "# g.run(query).to_data_frame()\n",
    "neighbors = {}\n",
    "for i in g.run(query, cid = \"8726758\", k = 5).data():\n",
    "    print(i)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{}"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "neighbors"
   ]
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "31f2aee4e71d21fbe5cf8b01ff0e069b9275f58929596ceb00d14d90e3e16cd6"
  },
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.8"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
